[
  {
    "name": "محمد بن موسى الخوارزمي",
    "field": "الجبر",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Al-Khwarizmi_portrait.jpg/250px-Al-Khwarizmi_portrait.jpg",

  "description": "أبو عبد الله محمد بن موسى الخوارزمي (حوالي 780–850م) هو عالم رياضيات وفلك وجغرافيا مسلم، وُلد في مدينة خوارزم (أوزبكستان اليوم)، وارتبط اسمه ببيت الحكمة في بغداد حيث ازدهر علمه تحت رعاية الخليفة العباسي المأمون. يُعد الخوارزمي أحد أعمدة العلم في الحضارة الإسلامية، وأشهر إسهاماته تأسيسه لعلم الجبر عبر كتابه الثوري \"المختصر في حساب الجبر والمقابلة\"، الذي قدم فيه منهجيةً لحل المعادلات الرياضية (خاصة التربيعية) باستخدام تقنيات مثل \"التحويل\" و\"المقابلة\"، مما جعل اسمه مرادفًا لهذا العلم الذي اشتُق اسمه الغربي \"Algebra\" من عنوان كتابه. كما أدخل الأرقام الهندية (المعروفة اليوم بالأرقام العربية) بما فيها مفهوم الصفر إلى العالم الإسلامي، ثم نقلها الأوروبيون عبر ترجمات لاتينية لكتبه، مثل كتاب \"الجمع والتفريق في الحساب الهندي\"، الذي شرح فيه النظام العشري وعمليات الحساب الأساسية. ولم تقتصر إنجازاته على الرياضيات؛ بل ساهم في الفلك عبر كتب مثل \"زيج السند الهند\" الذي ضم جداول لحساب حركات الكواكب، وفي الجغرافيا برسم خرائط دقيقة في كتاب \"صورة الأرض\". ولا يزال إرثه حيًا حتى اليوم؛ فكلمة \"Algorithm\" (الخوارزمية) مشتقة من اسمه، مما يجعله أبًا لفكرة الخوارزميات في علوم الحاسوب، بينما تُرجمت أعماله إلى اللاتينية في العصور الوسطى وأسهمت في النهضة العلمية الأوروبية. يُذكر الخوارزمي دائمًا كرمزٍ للعبقرية المنهجية التي جسّدت التكامل بين الثقافات وتطويع المعرفة لخدمة الإنسانية."
  },
  {
    "name": "إقليدس",
    "field": "الهندسة",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Euklid-von-Alexandria_1.jpg/250px-Euklid-von-Alexandria_1.jpg",
    "description": "إقليدس (حوالي 300 ق.م) هو عالم رياضيات يوناني عُرف بـ\"أبو الهندسة\"، وأشهر أعماله كتاب \"الأصول\" (أو العناصر) الذي جمع فيه مبادئ الهندسة والرياضيات مستخدمًا منهجًا استنتاجيًا قائمًا على البديهيات والمسلَّمات. وُلد في الإسكندرية حيث درَّس في مكتبتها العظيمة، واعتمد في كتابه على أعمال علماء سابقين مثل فيثاغورس وأرسطو، لكنه صاغها بشكل مُنظم ومترابط، مما جعل \"الأصول\" مرجعًا أساسيًا للرياضيات لأكثر من 2000 عام. قدم فيه مفاهيم مثل الهندسة الإقليدية (المبنية على مسلَّمة التوازي الشهيرة: \"من نقطة خارج خط يمكن رسم خط واحد موازٍ له\")، وبراهينَ حول خصائص الأشكال الهندسية، والأعداد الأولية، والنسب. تُرجم كتابه إلى العربية في العصر العباسي على يد حنين بن إسحاق والخوارزمي، وحفظه العلماء المسلمون قبل أن يصل إلى أوروبا في العصور الوسطى، حيث أصبح أساس النهضة العلمية. لا تزال نظرياته تُدرَّس حتى اليوم، وتُعدُّ رمزًا للتفكير المنطقي والصرامة الرياضية، مما يجعل إقليدس أحد أعظم العقول التي شكَّلت تاريخ العلوم."
  },
  {
    "name": "إسحاق نيوتن",
    "field": "التفاضل والتكامل",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/GodfreyKneller-IsaacNewton-1689.jpg/250px-GodfreyKneller-IsaacNewton-1689.jpg",
    "description": "السير إسحاق نيوتن (1643–1727م) هو عالم فيزياء ورياضيات إنجليزي يُعتبر أحد أعظم العقول في التاريخ العلمي، وأشهر أعماله كتاب \"الأصول الرياضية للفلسفة الطبيعية\" (Principia) الذي نشر عام 1687، وفيه صاغ قوانين الحركة الثلاثة (القصور الذاتي، والقوة، ورد الفعل) وقانون الجاذبية الكونية الذي وحد حركة الأجسام على الأرض والأجرام السماوية. قدم نيوتن أيضًا إسهامات جوهرية في حساب التفاضل والتكامل (بالاشتراك مع لايبنتز)، وفي البصريات حيث أثبت أن الضوء الأبيض مكون من ألوان الطيف باستخدام الموشور، وصمم التلسكوب العاكس الحديث. وُلد في قرية وولستورب ودرس في جامعة كامبريدج، حيث أصبح أستاذًا للرياضيات لاحقًا. تُعد نظرياته حجر الأساس للفيزياء الكلاسيكية، وألهمت عصر التنوير العلمي. كما شغل منصب رئيس الجمعية الملكية البريطانية، وسُكَّت أفكاره في قوانين تحكم الكون حتى اليوم، مما جعله رمزًا للعبقرية التي تجمع بين التجربة والرياضيات. يُنسب إليه مقولة شهيرة: \"إذا رأيتُ أبعد من غيري، فذلك لأني وقفت على أكتاف العمالقة\"."
  },
  {
    "name": "كارل فريدريش غاوس",
    "field": "نظرية الأعداد",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Carl_Friedrich_Gauss.jpg/250px-Carl_Friedrich_Gauss.jpg",
    "description": "وُلد كارل فريدريش غاوس (1777–1855م) في ألمانيا، وعُرف بـ\"أمير الرياضيات\" لعبقريته النادرة وإسهاماته التي غطت مجالاتٍ عديدة مثل الرياضيات، الفلك، والفيزياء. أظهر موهبة استثنائية منذ طفولته، حيث اكتشف طريقة ذكية لجمع الأعداد من 1 إلى 100 في لحظات وهو في التاسعة من عمره باستخدام المعادلة 2 / [n(n+1)]​. قدم إنجازاتٍ رائدة مثل نظرية الأعداد، حيث أثبت إمكانية بناء مضلع منتظم ذي 17 ضلعًا بالفرجار والمسطرة، ونشر كتابه الشهير \"التحقيقات الحسابية\" (1801) الذي وضع فيه أسس نظرية التبادل والتطابق. في علم الفلك، حسّن مدارات الكويكبات واكتشف الكوكب القزم سيريس باستخدام حساباته الدقيقة. كما طور التوزيع الطبيعي (منحنى غاوس) الذي يُعتبر حجر الزاوية في الإحصاء الحديث، واخترع المغناطيسومتر لدراسة المجالات المغناطيسية الأرضية. درّس في جامعة غوتنغن لأعوام طويلة، وحصل على لقب \"العالم الشامل\" لتنوع إسهاماته التي جمعت بين الدقة الرياضية والتطبيقات العملية. تُوفي في عام 1855، تاركًا إرثًا علميًا جعل منه أحد أعظم العقول في تاريخ البشرية."
  },
  {
    "name": "رونالد فيشر",
    "field": "الإحصاء",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Youngronaldfisher2.JPG/250px-Youngronaldfisher2.JPG",
    "description": "رونالد أي. فيشر (1890–1962م) هو عالم إحصاء ووراثة بريطاني يُعد من أبرز العقول العلمية في القرن العشرين، وواحدًا من الآباء المؤسسين لعلم الإحصاء الحديث. عُرف بإسهاماته الجوهرية في تطوير تحليل التباين (ANOVA) ووضع أسس تصميم التجارب الإحصائية، وهي أدوات أحدثت ثورة في البحث العلمي والعلوم التجريبية. كان لفيشر دور محوري في تأسيس علم الوراثة السكانية، حيث دمج قوانين الوراثة المندلية مع نظرية الانتقاء الطبيعي في كتابه الشهير \"النظرية الوراثية للانتقاء الطبيعي\" (The Genetical Theory of Natural Selection)، مما ساعد على صياغة ما يُعرف بالتركيب التطوري الحديث. كما أدخل مفاهيم رياضية متقدمة مثل تقدير الاحتمالية العظمى، وطبّقها على تحليل البيانات البيولوجية. وُلد في لندن ودرس في جامعة كامبريدج، رغم معاناته من ضعف شديد في البصر منذ الطفولة. شغل مناصب أكاديمية بارزة، وكان عضوًا مؤثرًا في الجمعية الملكية البريطانية. ترك فيشر أثرًا عميقًا في كل من الإحصاء والوراثة، ولا تزال أفكاره تشكل أساسًا مهمًا للبحث العلمي الحديث، ويُحتفى به كرائد جمع بين المنهج الرياضي الصارم والفكر البيولوجي العميق."
  },
  {
    "name": "بيير سيمون لابلاس",
    "field": "الاحتمالات",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Pierre-Simon%2C_marquis_de_Laplace_%281745-1827%29_-_Gu%C3%A9rin.jpg/250px-Pierre-Simon%2C_marquis_de_Laplace_%281745-1827%29_-_Gu%C3%A9rin.jpg",
    "description": "بيير سيمون لابلاس (1749–1827م) هو عالم رياضيات وفلك وفيزياء فرنسي، يُعتبر من أعظم علماء القرن الثامن عشر، وله إسهامات بارزة في الميكانيكا السماوية ونظرية الاحتمالات. اشتهر بعمله الضخم \"الميكانيكا السماوية\" (Mécanique Céleste)، الذي أعاد فيه صياغة قوانين نيوتن بلغة رياضية دقيقة وشرح حركة الكواكب والأقمار والمذنبات ضمن نموذج شامل لنظام الكون. كما كان من أوائل من اقترحوا فكرة أن النجوم قد تنهار تحت تأثير الجاذبية، وهي فكرة تُعد نواة مبكرة لمفهوم الثقوب السوداء. في مجال الرياضيات، ساهم لابلاس في تطوير نظرية الاحتمالات، وقدم توزيعًا يحمل اسمه (توزيع لابلاس)، كما ساهم في التحليل التفاضلي والمعادلات التفاضلية. وُلد في نورماندي، فرنسا، ودرس في باريس حيث لمع نجمه العلمي، وتقلد مناصب في الأكاديمية الفرنسية والجيش في عهد نابليون بونابرت. كانت فلسفته العلمية تقوم على الحتمية، وعبارته الشهيرة \"أعطني مواقع وسرعات جميع الأجسام، وسأحسب مستقبل الكون\" تُجسد رؤيته للكون كآلة رياضية دقيقة. يُعد لابلاس من أعمدة العلم الذين مهدوا لفيزياء العصر الحديث بربطهم بين الرياضيات والكون."
  },
  {
    "name": "أوغستان كوشي",
    "field": "التحليل الرياضي",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Augustin_Louis_Cauchy.jpg/330px-Augustin_Louis_Cauchy.jpg",
    "description": "وغستان-لويس كوشي (1789–1857م) هو عالم رياضيات فرنسي يُعد من أبرز مؤسسي التحليل الرياضي الحديث، وواحدًا من أكثر الرياضيين إنتاجًا وتأثيرًا في تاريخ الرياضيات. عُرف بإرسائه الأسس الصارمة لتحليل المتغيرات الحقيقية والمعقدة، حيث كان من أوائل من أدخلوا المفهوم الدقيق لـ \"النهاية\" (limit) و\"الاتصال\" (continuity) و\"التقارب\" (convergence)، مما جعل أعماله حجر الأساس للرياضيات الحديثة. كما وضع \"نظرية كوشي\" في التحليل العقدي، وهي من أهم النظريات في هذا المجال، وطور العديد من المفاهيم التي تحمل اسمه، مثل مبرهنة كوشي، تكامل كوشي، وتوزيع كوشي. وُلد كوشي في باريس وتلقى تعليمه في مدرسة البوليتكنيك، ثم شغل مناصب أكاديمية وعسكرية خلال عهود نابليون والملكية الفرنسية، وكان معروفًا بتدينه العميق ومواقفه الأخلاقية الصارمة. نشر أكثر من 800 ورقة بحثية وكتبًا متعددة غطت مجالات مثل الجبر، والميكانيكا، والهندسة، ونظرية الزمر. بفضل دقته وإسهاماته الواسعة، يُنظر إلى كوشي باعتباره من أعمدة التحليل الرياضي، وقد أثّر تأثيرًا عميقًا في الأجيال اللاحقة من علماء الرياضيات."
  },
  {
    "name": "جورج بول",
    "field": "المنطق الرياضي",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/George_Boole_color.jpg/250px-George_Boole_color.jpg",
    "description": "جورج بول (1815–1864م) هو عالم رياضيات وفيلسوف إنجليزي، يُعد من الروّاد الذين مهدوا لعلم الحوسبة والمنطق الرقمي الحديث. اشتهر بتأسيس الجبر البولياني (Boolean Algebra)، وهو نظام رياضي يستخدم القيمتين \"صح\" و\"خطأ\" (أو 0 و1) كأساس للعمليات المنطقية، ويُعد حجر الأساس في تصميم الدوائر الإلكترونية والحواسيب الحديثة. في كتابه الشهير \"تحقيق قوانين الفكر\" (The Laws of Thought) الصادر عام 1854، سعى بول لربط المنطق بالرياضيات، وقدم صيغة جبرية للتفكير المنطقي تشبه الطريقة التي تعمل بها الآلات الرقمية اليوم. وُلد بول في مدينة لنكولن بإنجلترا، وبدأ مسيرته العلمية بشكل ذاتي قبل أن يصبح أستاذًا في جامعة كوينز في كورك، أيرلندا. رغم وفاته المبكرة بسبب التهاب رئوي، فقد ترك إرثًا فكريًا تجاوز عصره بقرن، إذ لم تُستخدم أفكاره عمليًا إلا في القرن العشرين على يد علماء مثل كلود شانون، الذين اعتمدوا الجبر البولياني لتطوير نظرية المعلومات وتصميم الدوائر المنطقية. يُحتفى بجورج بول اليوم كأحد العقول المؤسسة للعصر الرقمي، ورمزًا للدمج بين التفكير الفلسفي الصارم والأسلوب الرياضي الدقيق."
  },
    {
    "name": "أرخميدس",
    "field": "الهندسة والميكانيكا",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Retrato_de_un_erudito_%28%C2%BFArqu%C3%ADmedes%3F%29%2C_por_Domenico_Fetti.jpg/250px-Retrato_de_un_erudito_%28%C2%BFArqu%C3%ADmedes%3F%29%2C_por_Domenico_Fetti.jpg",
    "description": "أرخميدس (حوالي 287–212 ق.م) هو عالم رياضيات ومخترع يوناني قديم من مدينة سيراقوسة في صقلية. يُعد من أعظم علماء الرياضيات في العصور القديمة ومن بين أكثر العلماء تأثيرًا في التاريخ. من أبرز إسهاماته اكتشاف مبدأ أرخميدس في دفع السوائل، والذي ينص على أن الجسم المغمور في سائل يتعرض لقوة دفع تساوي وزن السائل المزاح. كما ساهم بشكل بارز في تطوير هندسة الأشكال المتنوعة، وقدم أول تقدير دقيق لنسبة محيط الدائرة إلى قطرها (π). اخترع العديد من الأدوات الميكانيكية مثل الرافعة، والمسمار الحلزوني، وآلات أخرى تهدف إلى تحسين العمليات اليومية. كما عمل على دراسة خصائص الأسطح والأحجام. ابتكر طرقًا رياضية متقدمة لإيجاد حجم الأجسام المعقدة، وقام بتطوير تقنيات لحساب المساحات تحت المنحنيات. تُعد أعماله مصدرًا رئيسيًا لدراسة الميكانيكا والهندسة حتى اليوم."
  },
  {
    "name": "جون فون نيومان",
    "field": "نظرية الألعاب وعلوم الحاسوب",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/JohnvonNeumann-LosAlamos.gif/250px-JohnvonNeumann-LosAlamos.gif",
    "description": "جون فون نيومان (1903–1957م) هو عالم رياضيات وفيلسوف مجري-أمريكي، يُعتبر من أبرز العقول في القرن العشرين في مجال الرياضيات وعلوم الحاسوب. قدم العديد من الإسهامات التي غيرت وجه العلوم الحديثة، وأثر في مجال الرياضيات النظرية وعلم الحوسبة. عمل فون نيومان على تطوير نظرية الألعاب، وهي دراسة الاستراتيجيات الأمثل في المواقف التنافسية. كما كان له دور بارز في تطوير هندسة الكمبيوتر الحديثة، وابتكر العديد من المفاهيم الأساسية مثل معماريات الكمبيوتر والمعالجة المتوازية. كان أيضًا جزءًا من فريق تطوير القنبلة الهيدروجينية الأمريكية. في الرياضيات، قدم العديد من الدراسات في الجبر، التحليل الرياضي، ونظرية الاحتمالات، وكان له دور كبير في تطوير العمليات الحسابية للأعداد الكبيرة. يعد من العلماء المؤسسين لعلم الحوسبة الحديثة."
  },
  {
    "name": "ديفيد هيلبرت",
    "field": "المنطق الرياضي",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Hilbert.jpg/250px-Hilbert.jpg",
    "description": "ديفيد هيلبرت (1862–1943م) هو رياضياتي ألماني يعد من أبرز علماء الرياضيات في العصر الحديث. وهو مؤسس ما يُعرف بالرياضيات الحديثة، ويُعتبر من أهم الشخصيات التي ساهمت في تطوير المنطق الرياضي. قدم هيلبرت في عام 1900 قائمة من 23 مسألة رياضية تُعتبر من بين أهم الأسئلة التي كان يجب حلها من أجل تطوير الرياضيات. هذه المسائل ألهمت العديد من الرياضيين في القرن العشرين للعمل على حلها. كان هيلبرت مؤمنًا بأن الرياضيات يمكن أن تكون على أساس بديهيات صارمة، وطرحت أعماله تحديات فكرية مهمة في مجال المنطق ونظرية المجموعات. كما قدّم العديد من النظريات في الجبر والهندسة. تميز هيلبرت بأسلوبه الفلسفي في التفكير الرياضي، حيث كان يرى أن الرياضيات هي لغة الكون، وأنه لا يوجد حدود لما يمكن اكتشافه في هذا المجال."
  },
  {
    "name": "إيمي نوتر",
    "field": "الرياضيات التجريبية",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/EmmyNoether_MFO3096.jpg/250px-EmmyNoether_MFO3096.jpg",
    "description": "إيمي نوتر (1882–1935م) هي رياضيات ألمانية تُعد واحدة من أعظم العقول الرياضية في القرن العشرين. كان لها دور رئيسي في تطوير الجبر، خاصة في ما يتعلق بنظرية الزمر والتحليل التجريبي. قدمت إسهاماتها العميقة في فهم التناظر في المعادلات الرياضية والفيزيائية، وتُعتبر نظرية نوتر واحدة من أهم إنجازاتها، حيث تربط التناظر في الفيزياء بقوانين الحفظ. كما كانت لها إسهامات كبيرة في تطوير الجبر التجريبي والنظرية الحديثة للأعداد. رغم أنها عانت من تمييز شديد بسبب كونها امرأة في وقت كان فيه المجتمع الأكاديمي يهيمن عليه الرجال، إلا أن أعمالها أثبتت أنها واحدة من أكثر الشخصيات تأثيرًا في الرياضيات الحديثة. تُعد أعمالها حجر الزاوية للعديد من المفاهيم الرياضية المعاصرة."
  },
  {
    "name": "فيثاغورس",
    "field": "الهندسة والرياضيات",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Pythagoras_in_the_Roman_Forum%2C_Colosseum.jpg/250px-Pythagoras_in_the_Roman_Forum%2C_Colosseum.jpg",
    "description": "فيثاغورس (حوالي 570–495 ق.م) هو فيلسوف وعالم رياضيات يوناني قديم، عُرف بتطويره للعديد من المفاهيم الرياضية التي تُعدّ أساسًا للهندسة الإقليدية الحديثة. يعتبر فيثاغورس مؤسسًا لمدرسة فيثاغورية متخصصة في دراسة الرياضيات والفلسفة. من أشهر إنجازاته هي نظرية فيثاغورس الشهيرة، والتي تنص على أن مربع الوتر في مثلث قائم الزاوية يساوي مجموع مربعي الضلعين الآخرين. كما كان له دور كبير في دراسة الأعداد الأولية والمضاعفات، وأسهم في تطور فهم النسب والتناسبات في الرياضيات. إضافة إلى ذلك، كان فيثاغورس مهتمًا بشكل خاص بالعلاقة بين الرياضيات والموسيقى، حيث اكتشف أن النغمات الموسيقية يمكن تمثيلها باستخدام الأعداد، مما ساهم في تطوير التوازن بين الأبعاد الرياضية والفنية."
  },
  {
    "name": "أندريه فيرما",
    "field": "نظرية الأعداد والجبر",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Pierre_de_Fermat3.jpg/250px-Pierre_de_Fermat3.jpg",
    "description": "أندريه فيرما (1601–1665م) هو عالم رياضيات فرنسي يعتبر أحد مؤسسي نظرية الأعداد الحديثة. اشتهر بتطويره لما يُعرف بمبرهنة فيرما الكبرى، والتي كانت لغزًا رياضيًا استمرّ حله حتى بداية القرن الواحد والعشرين. كما قدم إسهامات كبيرة في الجبر، بما في ذلك مبرهنات تتعلق بالمعادلات التربيعية والأعداد الأولية. كان أيضًا من أوائل الذين قدموا نظرية في الحسابات الاحتمالية والنظريات المتعلقة بالجبر. وُلد فيرما في بوردو، فرنسا، وتُعتبر أعماله حجر الزاوية الذي سَهّل تطور الرياضيات في العصور اللاحقة."
  }

]
